_posts/technology/2023-02-06-cppcoreguidelines-enum8.html
---
layout: post
title: CppCoreGuidelines Enum.8 需要的时候才指定枚举项的值
categories: [technology]
tags: [CppCoreGuidelines]
---

<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Specify enumerator values only when necessary&rdquo;
</p>


<p>
理由
</p>

<p>
简单方便。避免枚举项的值重复。默认的值是按顺序设定的，对于 switch 语句的实现来说比较友好。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">enum</span> <span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Col1</span> <span style="color: #707183;">{</span> <span style="color: #000000;">red</span>, <span style="color: #000000;">yellow</span>, <span style="color: #000000;">blue</span> <span style="color: #707183;">}</span>;
<span style="color: #7F0055; font-weight: bold;">enum</span> <span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Col2</span> <span style="color: #707183;">{</span> <span style="color: #000000;">red</span> = 1, <span style="color: #000000;">yellow</span> = 2, <span style="color: #000000;">blue</span> = 2 <span style="color: #707183;">}</span>; <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">typo</span>
<span style="color: #7F0055; font-weight: bold;">enum</span> <span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Month</span> <span style="color: #707183;">{</span> <span style="color: #000000;">jan</span> = 1, <span style="color: #000000;">feb</span>, <span style="color: #000000;">mar</span>, <span style="color: #000000;">apr</span>, <span style="color: #000000;">may</span>, <span style="color: #000000;">jun</span>,
                   <span style="color: #000000;">jul</span>, <span style="color: #000000;">august</span>, <span style="color: #000000;">sep</span>, <span style="color: #000000;">oct</span>, <span style="color: #000000;">nov</span>, <span style="color: #000000;">dec</span> <span style="color: #707183;">}</span>;
                 <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">starting with 1 is conventional</span>
<span style="color: #7F0055; font-weight: bold;">enum</span> <span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Base_flag</span> <span style="color: #707183;">{</span> <span style="color: #000000;">dec</span> = 1, <span style="color: #000000;">oct</span> = dec &lt;&lt; 1, <span style="color: #000000;">hex</span> = dec &lt;&lt; 2 <span style="color: #707183;">}</span>; <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">set of bits</span>
</pre>
</div>

<p>
明确指定枚举项的值只有在这些情况下有用：
</p>
<ul class="org-ul">
<li>需要约定俗成的值，比如月份</li>
<li>连续的值不是想要的，如设定不同的比特位</li>
</ul>


<p>
强化
</p>
<ul class="org-ul">
<li>标记重复的枚举项值</li>
<li>标记多余的显式方式设定连续值的情况</li>
</ul>
